#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "");
	cout << "Мы с друзьями соберемся\n";
	cout << "У огромного костра.\n";
	cout << "Это пламя, словно солнце,\n";
	cout << "Будет греть нас до утра.\n";
	cout << "Все заботы, все проблемы\n";
	cout << "Улетают с пеплом ввысь...\n";
	cout << "Ах, как здорово, что все мы\n";
	cout << "Здесь сегодня собрались!\n";
	cout << "Отчего такой припев избитый,\n";
	cout << "Может, спросите вы меня?\n";
	cout << "Оттого, что брат наш инквизитор\n";
	cout << "Не бывает без огня.\n";
	cout << "Повсеместно гадят ведьмы\n";
	cout << "И колдуют колдуны.\n";
	cout << "Мир обязаны беречь мы\n";
	cout << "От влиянья Сатаны.\n";
	cout << "Кто там с огненной геенной\n";
	cout << "Наш костер посмел сравнить?\n";
	cout << "Можем разницу мгновенно\n";
	cout << "Вам на вас же объяснить.\n";
	cout << "Отчего наш взгляд такой сердитый\n";
	cout << "И такой подозрительный?\n";
	cout << "Оттого, что брат наш инквизитор\n";
	cout << "Быть обязан бдительным.\n";
	cout << "Ах, прекрасный миг узреть бы,\n";
	cout << "Чтоб в масштабах всей страны\n";
	cout << "Ни одной не стало ведьмы\n";
	cout << "И исчезли колдуны.\n";
	cout << "Но вопрос сочтем решенным\n";
	cout << "И поставим крест на нем,\n";
	cout << "Если только поголовно\n";
	cout << "Всех возьмем и пережжем!\n";
	cout << "На учете нашем каждый житель,\n";
	cout << "Ни о ком нам нельзя забыть!\n";
	cout << "Ведь, пока есть брат наш инквизитор,\n";
	cout << "Колдунам придется быть!\n";
	return 0;


}